fun main() 
{
    val kotlin = "🙂"
    println(kotlin)
}

//వివరణ:
fun main() Kotlin లో ప్రధాన function. ప్రోగ్రాం execution ఇది నుండే ప్రారంభమవుతుంది.

val kotlin = "🙂" - ఇది ఒక immutable variable kotlinను డిఫెయిన్ చేసి, దీంట్లో స్మైలీ ఎమోజీ "🙂" నిల్వచేస్తుంది.

println(kotlin) - ఈ variable kotlin లో ఉన్న విలువను console లో ప్రింట్ చేస్తుంది.

అవుట్‌పుట్:
text
🙂
ఇలా Kotlin లో main function లో ఎలాంటి variable, string, emoji, లేదా ఇతర డేటా assign చేసి, println విధంగా console లో చూపిస్తుంది. ఈ ప్రోగ్రాం emoji ను variable లో నిల్వ చేసి ప్రింట్ చేస్తోంది.
